nathanlnw/TJ_TRUCK_LOCAL/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/vdr.c
	uint16_t	blocks;         /*定义每次上传多少个数据块*/
	uint16_t	blocks_remain;  /*当前组织上传包是还需要的的blocks*/
}VDR_CMD;

VDR_CMD		vdr_cmd;

uint8_t		vdr_tx_info[1024];
uint16_t	vtr_tx_len = 0;

/*当前要写入数据的地址,8K边界对齐*/
static uint32_t		vdr_addr_curr_wr	= 0x0;
static YMDH_TIME	vdr_ymdh_curr_wr	= 0;

static uint8_t		fvdr_debug = 1;


/*传递写入文件的信息
   0...3  写入SerialFlash的地址
   4...31 文件名
 */
static uint8_t file_rec[32];

//=====================================================
VDR_INDEX         Vdr_Wr_Rd_Offset;      //  记录仪写索引 位置
VDR_DATA          VdrData;               //  行驶记录仪的databuf
VDR_TRIG_STATUS   VDR_TrigStatus;









//======================================================
/*
      遍历获取当前行驶记录的操作位置

      type :    0  代表遍历所有      08  09  10  11 12 13  14 
      u8    :     0   :遍历所有  
      
*/
u8  Vdr_PowerOn_getWriteIndex(u8 type)   
{
   
       u16    i;
	   u8	  c;  
      
	  //	 1.  get  address	


     switch(type)
     	{
		   case 0x08:
		   	           // 1.1  先读取第一个字符做判断
		   	           //rt_kprintf("\r\n 08H write=0x%X  \r\n",VDR_08H_START); 
		   	           for(i=0;i<VDR_08_MAXindex;i++)
		   	           	{
                            c=SST25V_ByteRead(VDR_08H_START+i*128);
						    if(c==0xFF)
						    {
						      Vdr_Wr_Rd_Offset.V_08H_Write=i; 
							  rt_kprintf("\r\n 08H write=%d  \r\n",Vdr_Wr_Rd_Offset.V_08H_Write); 
                              break;
						    }
		   	           	}
					   // 1.2. 没有找到2880 那么 擦除第一个  从0 开始
					   if(i==VDR_08_MAXindex)
					   	{
					   	   WatchDog_Feed();
				           SST25V_SectorErase_4KByte( VDR_08H_START );  
						   DF_delay_ms(100);
						   Vdr_Wr_Rd_Offset.V_08H_Write=0;
					   	}							   	
		   	          
		   	           break;
		   case 0x09:
		   	           //  2.1 
		   	           // rt_kprintf("\r\n 09H write=0x%X  \r\n",VDR_09H_START); 
		   	          for(i=0;i<360;i++)
		   	           	{
                            c=SST25V_ByteRead(VDR_09H_START+i*768);
						    if(c==0xFF)
						    {
						      Vdr_Wr_Rd_Offset.V_09H_Write=i; 
							  rt_kprintf("\r\n 09H write=%d  \r\n",Vdr_Wr_Rd_Offset.V_09H_Write); 
                              break;
						    }
		   	           	}
					   // 2. 没有找到360 那么 擦除第一个  从0 开始
					   if(i==360)
					   	{
					   	   WatchDog_Feed();
				           SST25V_SectorErase_4KByte( VDR_09H_START );   
						   DF_delay_ms(100);
						   Vdr_Wr_Rd_Offset.V_09H_Write=0;  
					   	} 
					   break;
		   
		   case 0x10:
		   	          //  rt_kprintf("\r\n 10H write=0x%X  \r\n",VDR_10H_START);  
		   	           for(i=0;i<100;i++)
		   	           	{
                            c=SST25V_ByteRead(VDR_10H_START+i*256);
						    if(c==0xFF)
						    {
						      Vdr_Wr_Rd_Offset.V_10H_Write=i; 
							  rt_kprintf("\r\n 10H write=%d  \r\n",Vdr_Wr_Rd_Offset.V_10H_Write);  
                              break;
						    }
		   	           	}
					   // 2. 没有找到100 那么 擦除第一个  从0 开始
					   if(i==100)
					   	{
					   	   WatchDog_Feed();
				           SST25V_SectorErase_4KByte( VDR_10H_START );    
						   DF_delay_ms(100);
						   Vdr_Wr_Rd_Offset.V_10H_Write=0;   
					   	}  
					   break;
		   
		   case 0x11:
		   	            for(i=0;i<100;i++)
		   	           	{
                            c=SST25V_ByteRead(VDR_11H_START+i*64);
						    if(c==0xFF)
						    {
						      Vdr_Wr_Rd_Offset.V_11H_Write=i; 
							  rt_kprintf("\r\n 11H write=%d  \r\n",Vdr_Wr_Rd_Offset.V_11H_Write);   
                              break;
						    }
		   	           	}
					   // 2. 没有找到100 那么 擦除第一个  从0 开始
					   if(i==100)
					   	{
					   	   WatchDog_Feed();
				           SST25V_SectorErase_4KByte( VDR_11H_START );    
						   DF_delay_ms(100);
						   Vdr_Wr_Rd_Offset.V_11H_Write=0;       
					   	}  
					   break;

		   case 0x12: 
		   	            for(i=0;i<200;i++)
		   	           	{
                            c=SST25V_ByteRead(VDR_12H_START+i*32);
						    if(c==0xFF)
						    {
						      Vdr_Wr_Rd_Offset.V_12H_Write=i; 
							  rt_kprintf("\r\n 12H write=%d  \r\n",Vdr_Wr_Rd_Offset.V_12H_Write);   
                              break;
						    }
		   	           	}
					    // 2. 没有找到200 那么 擦除第一个  从0 开始 
					    if(i==200)
					   	{
					   	   WatchDog_Feed();
				           SST25V_SectorErase_4KByte( VDR_12H_START );   
						   DF_delay_ms(100);
						   Vdr_Wr_Rd_Offset.V_12H_Write=0;           
					   	}  
						break;

		   case 0x13:   for(i=0;i<100;i++)
		   	           	{
                            c=SST25V_ByteRead(VDR_13H_START+i*8); 
						    if(c==0xFF)
						    {
						      Vdr_Wr_Rd_Offset.V_11H_Write=i; 
							  rt_kprintf("\r\n 13H write=%d  \r\n",Vdr_Wr_Rd_Offset.V_13H_Write);   
                              break;
						    }
		   	           	}
					   // 2. 没有找到100 那么 擦除第一个  从0 开始
					   if(i==100)
					   	{
					   	   WatchDog_Feed();
				           SST25V_SectorErase_4KByte( VDR_13H_START );     
						   DF_delay_ms(100);
						   Vdr_Wr_Rd_Offset.V_13H_Write=0;       
					   	}  
						break;

		   case 0x14:   
		   	             for(i=0;i<100;i++)
		   	           	{
                            c=SST25V_ByteRead(VDR_14H_START+i*8); 
						    if(c==0xFF)
						    {
						      Vdr_Wr_Rd_Offset.V_14H_Write=i; 
							  rt_kprintf("\r\n 14H write=%d  \r\n",Vdr_Wr_Rd_Offset.V_14H_Write);    
                              break;
						    }
		   	           	}
					   // 2. 没有找到100 那么 擦除第一个  从0 开始
					   if(i==100)
					   	{
					   	   WatchDog_Feed();
				           SST25V_SectorErase_4KByte( VDR_14H_START );        
						   DF_delay_ms(100);
						   Vdr_Wr_Rd_Offset.V_14H_Write=0;       
					   	}  
						break;

		   case 0x15:
		   	            for(i=0;i<10;i++)
		   	           	{
                            c=SST25V_ByteRead(VDR_15H_START+i*256);  
						    if(c==0xFF)
						    {
						      Vdr_Wr_Rd_Offset.V_15H_Write=i; 
							  rt_kprintf("\r\n 15H write=%d  \r\n",Vdr_Wr_Rd_Offset.V_15H_Write);    
                              break;
						    }
		   	           	}
					   // 2. 没有找到10 那么 擦除第一个  从0 开始
					   if(i==10)
					   	{
					   	   WatchDog_Feed();
				           SST25V_SectorErase_4KByte( VDR_15H_START );     
						   DF_delay_ms(100);
						   Vdr_Wr_Rd_Offset.V_15H_Write=0;          
					   	}  
						break;

