nathanlnw/TJ_TRUCK_LOCAL/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/vdr.c
     	}

}


//    遍历所有行车记录写入的起始地址   from  08H
void total_ergotic(void)    
{
    Vdr_PowerOn_getWriteIndex(0x08);
    Vdr_PowerOn_getWriteIndex(0x09);
	Vdr_PowerOn_getWriteIndex(0x10);
    Vdr_PowerOn_getWriteIndex(0x11);
	Vdr_PowerOn_getWriteIndex(0x12);
    Vdr_PowerOn_getWriteIndex(0x13);
	Vdr_PowerOn_getWriteIndex(0x14);
	Vdr_PowerOn_getWriteIndex(0x15);     

	Vdr_Wr_Rd_Offset.V_07H_Read=0;
	Vdr_Wr_Rd_Offset.V_08H_Read=0;
	Vdr_Wr_Rd_Offset.V_09H_Read=0;
	Vdr_Wr_Rd_Offset.V_10H_Read=0;
	Vdr_Wr_Rd_Offset.V_11H_Read=0;
	Vdr_Wr_Rd_Offset.V_12H_Read=0;
	Vdr_Wr_Rd_Offset.V_13H_Read=0;
	Vdr_Wr_Rd_Offset.V_14H_Read=0;
	Vdr_Wr_Rd_Offset.V_15H_Read=0; 
}
FINSH_FUNCTION_EXPORT( total_ergotic, total_ergotic );
//   只能在初始化是用到
void vdr_erase(void) 
{
   u16  i=0;
    // start address        0x316000        start sector :790th        total: 195 sector 

    //  1. erase  to  839          840-790=50 
// if(rt_mutex_take(DF_lock_mutex,150)==RT_EOK) 
{
   DF_LOCK=1;
	//  32K
	 rt_kprintf("\r\n   <------------  vdr  area  erase  0 ------------------>\r\n");   
   for(i=0;i<10;i++)
   {
	 WatchDog_Feed();
	 SST25V_SectorErase_4KByte(VDR_START_ADDRESS+i*SECTORSIZE);  	 
	// rt_kprintf("\r\n  addr=0x%X \r\n",VDR_START_ADDRESS+i*SECTORSIZE);   
     delay_ms(130);     
	 
   }	 
   
   rt_kprintf("\r\n   <------------  vdr  area  erase  1 ------------------>\r\n");   
   
   #if 1
   // 195-50=145         145-64*2=17             0x320000
   for(i=0;i<22;i++) 
   {
	 WatchDog_Feed();
	// SST25V_BlockErase_64KByte(VDR_START_ADDRESS+0xA000+i*0x10000);   // 32k  <=> 0x8000   
      
	 SST25V_BlockErase_32KByte(VDR_START_ADDRESS+0xA000+i*0x8000);   // 32k  <=> 0x8000   8sector
     DF_delay_ms(700); 
	 WatchDog_Feed();
	 
	// rt_kprintf("\r\n  addr=0x%X \r\n",VDR_START_ADDRESS+0xA000+i*0x8000);   
	//  rt_kprintf("\r\n   <------------ erase 32K : %d\r\n",i+1);    
   }
  #endif

  
   DF_LOCK=0;
 //  rt_mutex_release(DF_lock_mutex);  
 }   

   rt_kprintf("\r\n   <------------  vdr  area  erase   over  ------------------>\r\n");  
}
FINSH_FUNCTION_EXPORT( vdr_erase, vdr_erase ); 




/*
         根据输入的类型，和起始时间查找到符合条件的起始地址和条数
*/
void query_vdr(u8 type,u8 *intime, u16 current_start,u16 num)
{
  u16 i=0;
	u8  c;

   switch(type)
   {
		  case 0x08:
					  // 1.1  先读取当前写入过的时间
                      if(Vdr_Wr_Rd_Offset.V_08H_Write==0)
                      	{
                             current_start=0;
							 num=0;
							 break;
                      	}
                      
                      //  1.2    读取当前最近的记录的时间
					  
					  for(i=0;i<VDR_08_MAXindex;i++)
					   {
						   c=SST25V_ByteRead(VDR_08H_START+i*128);
						   if(c==0xFF)
						   {
							 Vdr_Wr_Rd_Offset.V_08H_Write=i; 
							 rt_kprintf("\r\n 08H write=%d	\r\n",Vdr_Wr_Rd_Offset.V_08H_Write); 
							 break;
						   }
					   }
					  // 1.2. 没有找到2880 那么 擦除第一个	从0 开始
					  if(i==VDR_08_MAXindex) 
					   {
						  WatchDog_Feed();
						  SST25V_SectorErase_4KByte( VDR_08H_START );  
						  DF_delay_ms(100);
						  Vdr_Wr_Rd_Offset.V_08H_Write=0;
					   }							   
					 
					  break;
		  case 0x09:
					  //  2.1 
					 for(i=0;i<360;i++)
					   {
						   c=SST25V_ByteRead(VDR_09H_START+i*768);
						   if(c==0xFF)
						   {
							 Vdr_Wr_Rd_Offset.V_09H_Write=i; 
							 rt_kprintf("\r\n 09H write=%d	\r\n",Vdr_Wr_Rd_Offset.V_09H_Write); 
							 break;
						   }
					   }
					  // 2. 没有找到360 那么 擦除第一个  从0 开始
					  if(i==360)
					   {
						  WatchDog_Feed();
						  SST25V_SectorErase_4KByte( VDR_09H_START );	
						  DF_delay_ms(100);
						  Vdr_Wr_Rd_Offset.V_09H_Write=0;  
					   } 
					  break;
		  
		  case 0x10:
					  for(i=0;i<100;i++)
					   {
						   c=SST25V_ByteRead(VDR_10H_START+i*256);
						   if(c==0xFF)
						   {
							 Vdr_Wr_Rd_Offset.V_10H_Write=i; 
							 rt_kprintf("\r\n 10H write=%d	\r\n",Vdr_Wr_Rd_Offset.V_10H_Write);  
							 break;
						   }
					   }
					  // 2. 没有找到100 那么 擦除第一个  从0 开始
					  if(i==100)
					   {
						  WatchDog_Feed();
						  SST25V_SectorErase_4KByte( VDR_10H_START );	
						  DF_delay_ms(100);
						  Vdr_Wr_Rd_Offset.V_10H_Write=0;	
					   }  
					  break;
		  
		  case 0x11:
					   for(i=0;i<100;i++)
					   {
						   c=SST25V_ByteRead(VDR_11H_START+i*64);
						   if(c==0xFF)
						   {
							 Vdr_Wr_Rd_Offset.V_11H_Write=i; 
							 rt_kprintf("\r\n 11H write=%d	\r\n",Vdr_Wr_Rd_Offset.V_11H_Write);   
							 break;
						   }
					   }
					  // 2. 没有找到100 那么 擦除第一个  从0 开始
					  if(i==100)
					   {
						  WatchDog_Feed();
						  SST25V_SectorErase_4KByte( VDR_11H_START );	
						  DF_delay_ms(100);
						  Vdr_Wr_Rd_Offset.V_11H_Write=0;		
					   }  
					  break;
   
		  case 0x12: 
					   for(i=0;i<200;i++)
					   {
						   c=SST25V_ByteRead(VDR_12H_START+i*32);
						   if(c==0xFF)
						   {
							 Vdr_Wr_Rd_Offset.V_12H_Write=i; 
							 rt_kprintf("\r\n 12H write=%d	\r\n",Vdr_Wr_Rd_Offset.V_12H_Write);   
							 break;
						   }
					   }
					   // 2. 没有找到200 那么 擦除第一个  从0 开始 
					   if(i==200)
					   {
						  WatchDog_Feed();
						  SST25V_SectorErase_4KByte( VDR_12H_START );		
						  DF_delay_ms(100);
						  Vdr_Wr_Rd_Offset.V_12H_Write=0;			
					   }  
					   break;
   
		  case 0x13:   for(i=0;i<100;i++)
					   {
						   c=SST25V_ByteRead(VDR_13H_START+i*8); 
						   if(c==0xFF)
						   {
							 Vdr_Wr_Rd_Offset.V_11H_Write=i; 
							 rt_kprintf("\r\n 13H write=%d	\r\n",Vdr_Wr_Rd_Offset.V_13H_Write);   
							 break;
						   }
					   }
					  // 2. 没有找到100 那么 擦除第一个  从0 开始
					  if(i==100)
					   {
						  WatchDog_Feed();
						  SST25V_SectorErase_4KByte( VDR_13H_START );		
						  DF_delay_ms(100);
						  Vdr_Wr_Rd_Offset.V_13H_Write=0;		
					   }  
					   break;
   
		  case 0x14:   
						for(i=0;i<100;i++)
					   {
						   c=SST25V_ByteRead(VDR_14H_START+i*8); 
						   if(c==0xFF)
						   {
							 Vdr_Wr_Rd_Offset.V_14H_Write=i; 
							 rt_kprintf("\r\n 14H write=%d	\r\n",Vdr_Wr_Rd_Offset.V_14H_Write);	
							 break;
						   }
					   }
					  // 2. 没有找到100 那么 擦除第一个  从0 开始
					  if(i==100)
					   {
						  WatchDog_Feed();
						  SST25V_SectorErase_4KByte( VDR_14H_START );		 
						  DF_delay_ms(100);
						  Vdr_Wr_Rd_Offset.V_14H_Write=0;		
					   }  
					   break;
   
		  case 0x15:
					   for(i=0;i<10;i++)
					   {
						   c=SST25V_ByteRead(VDR_15H_START+i*256);	
						   if(c==0xFF)
						   {
							 Vdr_Wr_Rd_Offset.V_15H_Write=i; 
							 rt_kprintf("\r\n 15H write=%d	\r\n",Vdr_Wr_Rd_Offset.V_15H_Write);	
							 break;
						   }
					   }
					  // 2. 没有找到10 那么 擦除第一个	从0 开始
					  if(i==10)
					   {
						  WatchDog_Feed();
						  SST25V_SectorErase_4KByte( VDR_15H_START );		
						  DF_delay_ms(100);
						  Vdr_Wr_Rd_Offset.V_15H_Write=0;		   
					   }  
					   break;
   
