nathanlnw/TJ_TRUCK_LOCAL/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/vdr.c
	   }

 
}

//    创建行驶记录仪数据  

void  VDR_product_08H_09H_10H(void)
{
  
  u16 j=0,cur=0;	 
  
  //  行驶记录相关数据产生 触发,  且定位的情况下   
  if((VDR_TrigStatus.Running_state_enable==1)&&(UDP_dataPacket_flag==0X02)) 	  
  { 	//	  必须在行驶状态下
			
			//-------------------  08H	 --------------------------------------------------
			if((Temp_Gps_Gprs.Time[2]==0)&&(VDR_TrigStatus.Running_state_enable==1)) 
			{  // 秒为0 
				// 0.  判断是否是第一次上电
				if((VdrData.H_08[0]==0x00)&&(VdrData.H_08[1]==0x00)) 
				{
					  rt_kprintf("\r\n first  get  08H	  \r\n");
				}
				else
				{ 
					  memcpy(VdrData.H_08_BAK,VdrData.H_08,126);
					  VdrData.H_08_saveFlag=1;	//	 保存  当前分钟的数据记录					 
				}	 
			   //  1.  年月日 时分秒	 秒是0
				 VdrData.H_08[0]=((Temp_Gps_Gprs.Date[0]/10)<<4)+(Temp_Gps_Gprs.Date[0]%10);	   
				 VdrData.H_08[1]=((Temp_Gps_Gprs.Date[1]/10)<<4)+(Temp_Gps_Gprs.Date[1]%10); 
				 VdrData.H_08[2]=((Temp_Gps_Gprs.Date[2]/10)<<4)+(Temp_Gps_Gprs.Date[2]%10);
				 VdrData.H_08[3]=((Temp_Gps_Gprs.Time[0]/10)<<4)+(Temp_Gps_Gprs.Time[0]%10);
				 VdrData.H_08[4]=((Temp_Gps_Gprs.Time[1]/10)<<4)+(Temp_Gps_Gprs.Time[1]%10);
				 VdrData.H_08[5]=0; 	
  
			   // 2.  initial 
			   memset(VdrData.H_08+6,0xFF,120);    // 默认是 0xFF
			}  
			   // 3.   save 	Minute		   1-59   s 		
			   VdrData.H_08[6+2*Temp_Gps_Gprs.Time[2]]=Speed_gps/10; //km/h
			   VdrData.H_08[7+2*Temp_Gps_Gprs.Time[2]]=Vehicle_sensor;	
  
		  //------------------------09H ---------  min=0;	sec=0	----------------------------
		   if((Temp_Gps_Gprs.Time[1]==0)&&(Temp_Gps_Gprs.Time[2]==0)) 
		   {
			   
				// 1.  判断是否是需要存储
					VdrData.H_09_saveFlag=1;  //   保存  当前分钟的数据记录 
			   //  2.  年月日 时分秒	 |	 分  秒是0
				 VdrData.H_09[0]=((Temp_Gps_Gprs.Date[0]/10)<<4)+(Temp_Gps_Gprs.Date[0]%10);	   
				 VdrData.H_09[1]=((Temp_Gps_Gprs.Date[1]/10)<<4)+(Temp_Gps_Gprs.Date[1]%10); 
				 VdrData.H_09[2]=((Temp_Gps_Gprs.Date[2]/10)<<4)+(Temp_Gps_Gprs.Date[2]%10);
				 VdrData.H_09[3]=((Temp_Gps_Gprs.Time[0]/10)<<4)+(Temp_Gps_Gprs.Time[0]%10);
				 VdrData.H_09[4]=0;
				 VdrData.H_09[5]=0;
  
				 //  initial  0xFF
				 memset(VdrData.H_09+6,0xFF,660);	 // 默认是 0xFF
  
		   }   
		   else
			// 3.  判断是否是第一次上电 ,  如果是那么给他赋值
		   if((VdrData.H_09[0]==0x00)&&(VdrData.H_09[1]==0x00))  // 年月为 0
		   {
				 VdrData.H_09[0]=((Temp_Gps_Gprs.Date[0]/10)<<4)+(Temp_Gps_Gprs.Date[0]%10);	   
				 VdrData.H_09[1]=((Temp_Gps_Gprs.Date[1]/10)<<4)+(Temp_Gps_Gprs.Date[1]%10); 
				 VdrData.H_09[2]=((Temp_Gps_Gprs.Date[2]/10)<<4)+(Temp_Gps_Gprs.Date[2]%10);
				 VdrData.H_09[3]=((Temp_Gps_Gprs.Time[0]/10)<<4)+(Temp_Gps_Gprs.Time[0]%10);
				 VdrData.H_09[4]=0; 
				 VdrData.H_09[5]=0;
		   }   
  
		   //  4 .	填写常规位置	1-59 min
		   if(Temp_Gps_Gprs.Time[2]==59)  // 59 秒时候做处理，如果是0 那么分钟就变了
		   {  
			  //   表 A.20		  (当前分钟的位置  +	当前分钟的平均速度) 
			  memcpy( VdrData.H_09+6+Temp_Gps_Gprs.Time[1]*11,VdrData.Longi,4);  // 经度
			  memcpy( VdrData.H_09+6+Temp_Gps_Gprs.Time[1]*11+4,VdrData.Lati,4); //纬度
			  VdrData.H_09[6+Temp_Gps_Gprs.Time[1]*11+8]=(GPS_Hight>>8);
			  VdrData.H_09[6+Temp_Gps_Gprs.Time[1]*11+9]=GPS_Hight; 		   
			  //  当前分钟的平均速度	 从AvrgSpd_MintProcess()  引用的变量
			  VdrData.H_09[6+Temp_Gps_Gprs.Time[1]*11+10]= PerMinSpdTotal/AspdCounter;			  
		   }
		 //-------------------- 10H    事故疑点数据  ---------------------------------
		 if((VdrData.H_10_saveFlag==0)&&(XinhaoStatus[11]=='1')&&(XinhaoStatusBAK[11]=='0')) 
		 {	//	刹车状态发生变化
			  //  1.  行驶结束时间
			 time_now=Get_RTC();	 //  RTC  相关 
			 Time2BCD(VdrData.H_10); 
			 //   2.   机动车驾驶证号码
			 memcpy(VdrData.H_10+6,JT808Conf_struct.Driver_Info.DriverCard_ID,18);
			 //   3.  速度和状态信息   
					  //-----------------------  Status Register   --------------------------------
					cur=save_sensorCounter;  //20s的事故疑点
					for(j=0;j<100;j++)
					{
						VdrData.H_10[24+j*2]=Sensor_buf[cur].DOUBTspeed;	//速度
						VdrData.H_10[24+j*2+1]=Sensor_buf[cur].DOUBTstatus;   //状态	
						
						if(cur>0)	  // 从当前往前读取
						   cur--;
						else
						   cur=100; 						   
					}  
			 // 	4.	位置信息
			  memcpy( VdrData.H_10+224,VdrData.Longi,4);  // 经度
			  memcpy( VdrData.H_10+224+4,VdrData.Lati,4); //纬度
			  VdrData.H_10[224+8]=(GPS_Hight>>8);
					VdrData.H_10[224+9]=GPS_Hight;	
  
			 //--------------------------------------------------------------------------			  
			 VdrData.H_10_saveFlag=1;
		 }		
		 memcpy(XinhaoStatusBAK,XinhaoStatus,20);
		 // Vehicle_sensor_BAK=Vehicle_sensor;
  
   }
  
  
}


void VDR_product_11H_Start(void)
{
           //    11 H   连续驾驶开始时间   和起始位置     从60s 开始算驾驶起始
                   if(VDR_TrigStatus.Run_baseon_spd_10s_couter==60)
                   	{ 
                   	    //  1.   机动车驾驶证号
                   	    memcpy(VdrData.H_11,JT808Conf_struct.Driver_Info.DriverCard_ID,18);
					    //   2.   起始时间
						time_now=Get_RTC();     //  RTC  相关 
			            Time2BCD(VdrData.H_11+18); 
                        //   3.  起始位置                        
						memcpy( VdrData.H_11+30,VdrData.Longi,4);  // 经度
						memcpy( VdrData.H_11+30+4,VdrData.Lati,4); //纬度
						VdrData.H_11[30+8]=(GPS_Hight>>8);
						VdrData.H_11[30+9]=GPS_Hight;	

                   	}
}

void VDR_product_11H_End(void)
{
         if(TiredConf_struct.TiredDoor.Door_DrvKeepingSec<0) 
		 	 return;
            //         11 H     相关
        if(VDR_TrigStatus.Run_baseon_spd_10s_couter>TiredConf_struct.TiredDoor.Door_DrvKeepingSec)
        	{
                   
			
                    //   2.   结束时间
						time_now=Get_RTC();     //  RTC  相关 
			            Time2BCD(VdrData.H_11+25); 
                        //   3.  起始位置                        
						memcpy( VdrData.H_11+40,VdrData.Longi,4);  // 经度
						memcpy( VdrData.H_11+40+4,VdrData.Lati,4); //纬度
						VdrData.H_11[40+8]=(GPS_Hight>>8);
						VdrData.H_11[40+9]=GPS_Hight;	
                    //    4.   save 
                    VdrData.H_11_saveFlag=1; 
        	}
}




void VDR_product_12H(u8  value)    // 插拔卡记录
{
     //   1. 时间发生的时间
		time_now=Get_RTC();     //  RTC  相关 
        Time2BCD(VdrData.H_12); 

     //  2.   机动车驾驶证号
         memcpy(VdrData.H_12+6,JT808Conf_struct.Driver_Info.DriverCard_ID,18);
     //  3.  结果 
         VdrData.H_12[24]=value;

	 // 4.  save 
	     VdrData.H_12_saveFlag=1; 
}


//  Note :  定义了但是没有用，不带电池情况下，断电操作SPI DF  危害会很大
void VDR_product_13H(u8  value)    //  外部供电记录
{
       //   1. 时间发生的时间
		time_now=Get_RTC();     //  RTC  相关 
        Time2BCD(VdrData.H_13); 
       //  2.  value
         VdrData.H_13[6]=value;
       //  3. save
       VdrData.H_13_saveFlag=1; 
}


