nathanlnw/TJ_TRUCK_LOCAL/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/vdr.c
void VDR_product_14H(u8 cmdID)    // 记录仪参数修改记录
{

    //   1. 时间发生的时间
		time_now=Get_RTC();     //  RTC  相关 
        Time2BCD(VdrData.H_14); 
       //  2.  value
         VdrData.H_14[6]=cmdID;
       //  3. save
       VdrData.H_14_saveFlag=1;
}


 
// note  :    需要索引检索   08 H 的数据记录 ，这里不需要填充。
void VDR_product_15H(u8  value)    //  采集指定速度记录 
{
    




}

void  VDR_get_15H_StartEnd_Time(u8  *Start, u8 *End)  
{
    u8  i=0;

	for(i=0;i<6;i++)
	{
      VdrData.H_15_Set_StartDateTime[i]=Start[i];
	  VdrData.H_15_Set_EndDateTime[i]=End[i];
	}
	
}

//------- stuff     user data       ---------------
u16  stuff_drvData(u8 type,u16 Start_recNum,u16 REC_nums,u8 *dest)
{
    u16  res_len=0,get_len=0;
    u16  i=0;

	for(i=0;i<REC_nums;i++)
	{
	  switch(type)
	  	{
	  	   case 0x08:
                     get_len=get_08h(Start_recNum+i,dest+res_len);
					 break;
		   case 0x09:
                     get_len=get_09h(Start_recNum+i,dest+res_len);    
					 break;
		   case 0x10:
                     get_len=get_10h(Start_recNum+i,dest+res_len);
					 break;
		   case 0x11:
                     get_len=get_11h(Start_recNum+i,dest+res_len);
					 break;
		   case 0x12:
                     get_len=get_12h(Start_recNum+i,dest+res_len);
					 break;	
		   case 0x13:
                     get_len=get_13h(Start_recNum+i,dest+res_len);
					 break;		
		   case 0x14:
                     get_len=get_14h(Start_recNum+i,dest+res_len);
					 break;		
		   case 0x15:
                     get_len=get_15h(Start_recNum+i,dest+res_len); 
					 break;	
		   default:
		   	         return 0;

	  	}
	   
	   res_len+=get_len;
	}    
    return   res_len;
}









// 00H  采集行车记录仪执行标准版本
u16   get_00h(u8  *p_in ,u16 inLen, u8 *p_out)   
{

 
}

// 01H  采集当前驾驶员人信息
u16   get_01h(u8  *p_in ,u16 inLen, u8 *p_out)  
{

 return 0;
}

//  02H   采集记录仪的实时时间
u16   get_02h(u8  *p_in ,u16 inLen, u8 *p_out)  
{

 return 0;
}

// 03H  采集累计行驶里程
u16   get_03h(u8  *p_in ,u16 inLen, u8 *p_out)  
{

 return 0;
}

u16   get_04h(u8  *p_in ,u16 inLen, u8 *p_out)  
{

 return 0;
}

u16   get_05h(u8  *p_in ,u16 inLen, u8 *p_out)  
{

 return 0;
}

u16   get_06h(u8  *p_in ,u16 inLen, u8 *p_out)  
{

 return 0;
}

u16   get_07h(u8  *p_in ,u16 inLen, u8 *p_out)  
{

 return 0;
}

/*
   行驶速度记录
   不管他，自己填数据，自己报
   单条126字节每分钟
   48*60=2880包

    每一条   128 字节

 */

u16 get_08h( u16 indexnum,u8 *p)    
{
	int			i;
	uint8_t		buf[128];
    u32  addr=0;
	u8  FCS=0;


    
	//	  1.  get  address	 
	 addr=VDR_08H_START+indexnum*128;

   //    2. read   
      SST25V_BufferRead(buf, addr, 128 );
      DF_delay_ms(80);
       OutPrint_HEX("08H content",buf,128); // debug   
   //     3.  FCS  check
           FCS=0;
       for(i=0;i<127;i++)
	 	   FCS^=buf[i];
	   if(buf[127]!=FCS)
	   	{
	   	     rt_kprintf("\r\n  08H read fcs error  save:%X  cacu: %X \r\n",buf[127],FCS);
             return  0;
	   	}
     if(buf[0]==MarkByte)
      {  
         memcpy(p,buf+1,126);
	     return  126;
      }	
	 else 
	 	 return 0; 
}



//FINSH_FUNCTION_EXPORT( get_08h, get_08 );


/*
   位置信息
   360小时   ，每小时666字节
 */

u16  get_09h( u16 indexnum,u8 *p)  
{
	 int		 i;
	 uint8_t	 buf[669];
	 u32  addr=0;
	 u8  FCS=0;
	
	
	 
	 //    1.  get	address   
	  addr=VDR_09H_START+indexnum*768;
	
	//	  2. read	
	   SST25V_BufferRead(buf, addr, 669 ); //2+content 
	   DF_delay_ms(80);
	   OutPrint_HEX("09H content",buf,669); // debug 
	//	   3.  FCS	check
	          FCS=0;
		for(i=0;i<667;i++)
			FCS^=buf[i];
		if(buf[667]!=FCS)
		 {
			  rt_kprintf("\r\n	09H read fcs error	save:%X  cacu: %X \r\n",buf[667],FCS);
			  return  0;
		 }
	  if(buf[0]==MarkByte)
	   {  
		  memcpy(p,buf+1,666); 
		  return  666;
	   } 
	  else 
		  return 0; 

}

//FINSH_FUNCTION_EXPORT( get_09h, get_09 );


/*
   事故疑点
   234Byte
   共100个
 */
u16 get_10h( u16 indexnum,u8 *p)  
{
	 int		 i;
	 uint8_t	 buf[237];
	 u32  addr=0;
	 u8   FCS=0;
	
	
	 
	 //    1.  get	address   
	  addr=VDR_10H_START+indexnum*256;
	
	//	  2. read	
	   SST25V_BufferRead(buf, addr, 236 );	
	   DF_delay_ms(80); 
	   OutPrint_HEX("10H content",buf,236); // debug 
	//	   3.  FCS	check
	         FCS=0;
		for(i=0;i<235;i++)
			FCS^=buf[i];
		if(buf[235]!=FCS)
		 {
			  rt_kprintf("\r\n	10H read fcs error	save:%X  cacu: %X \r\n",buf[235],FCS);
			  return  0;
		 }
	  if(buf[0]==MarkByte)
	   {  
		  memcpy(p,buf+1,234); 
		  return  234;
	   } 
	  else 
		  return 0; 

}

//FINSH_FUNCTION_EXPORT( get_10h, get_10 );


/*超时驾驶记录
   50Bytes   100条

      每个记录   64   个字节
 */

u16 get_11h( u16 indexnum,u8 *p)   
{
	
	 int		 i;
	 uint8_t	 buf[60];
	 u32  addr=0;
	 u8  FCS=0;
	
	
	 
	 //    1.  get	address   
	  addr=VDR_11H_START+indexnum*64;
	
	//	  2. read	
	   SST25V_BufferRead(buf, addr, 52 );	
	   DF_delay_ms(10);
	   OutPrint_HEX("11H content",buf,52); // debug 
	//	   3.  FCS	check
	        FCS=0;
		for(i=0;i<51;i++)
			FCS^=buf[i];
		if(buf[51]!=FCS)
		 {
			  rt_kprintf("\r\n	11H read fcs error	save:%X  cacu: %X \r\n",buf[51],FCS);
			  return  0;
		 }
	  if(buf[0]==MarkByte)
	   {  
		  memcpy(p,buf+1,50); 
		  return  50;
	   } 
	  else 
		  return 0; 

	
}

//FINSH_FUNCTION_EXPORT( get_11h, get_11 );


/*驾驶员身份登录
   25Bytes   200条
 */

u16 get_12h( u16 indexnum,u8 *p)  
{
     int		 i;
	 uint8_t	 buf[30];
	 u32  addr=0;
	 u8  FCS=0;
	
	
	 
	 //    1.  get	address   
	  addr=VDR_12H_START+indexnum*32;
	
	//	  2. read	
	   SST25V_BufferRead(buf, addr, 27 ); 
	   DF_delay_ms(10);
	   OutPrint_HEX("12H content",buf,27); // debug 
	//	   3.  FCS	check
	       FCS=0;
		for(i=0;i<26;i++)
			FCS^=buf[i];
		if(buf[26]!=FCS)
		 {
			  rt_kprintf("\r\n	11H read fcs error	save:%X  cacu: %X \r\n",buf[26],FCS); 
			  return  0;
		 }
	  if(buf[0]==MarkByte)
	   {  
		  memcpy(p,buf+1,25); 
		  return  25;
	   } 
	  else 
		  return 0; 
}

//FINSH_FUNCTION_EXPORT( get_12h, get_12 );


/*外部供电记录
   7字节 100条**/
u16 get_13h( u16 indexnum,u8 *p)  
{
    // int		 i;
	 uint8_t	 buf[10];
	 u32  addr=0;
	// u8  FCS=0;
	
	
	 
	 //    1.  get	address   
	  addr=VDR_13H_START+indexnum*8;
	
	//	  2. read	
	   SST25V_BufferRead(buf, addr, 8 );	
	   OutPrint_HEX("13H content",buf,8); // debug 
	//	   3.  FCS	check
	  if(buf[0]==MarkByte)
	   {  
		  memcpy(p,buf+1,7); 
		  return  7;
	   } 
	  else 
		  return 0; 

